web/GrupoTea/app/Models/profes.php

SELECT *
FROM `medicos`
---
    public function listar()
    {
      $users = new usuari();
      $profesionales = $this->db->table('medicos');
      $res = $profesionales->get()->getResult();