web/GrupoTea/app/Models/turnos.php

SELECT *
FROM `turnos`
WHERE `Día` = '2023-11-20'
AND `Medic` = '1'
ORDER BY `Hora` ASC
---
    public function listar($day,$med)
    {
      $users = new usuari();
      $profesionales = $this->db->table('turnos');
      $profesionales->where('Día',$day);
      $profesionales->where('Medic',$med);
      $profesionales->orderBy('Hora','ASC');
      $res = $profesionales->get()->getResult();

SELECT *
FROM `turnos`
WHERE `User` = '1'
ORDER BY `Día` ASC, `Hora` ASC
---
    public function listarUser($id)
    {
      $prof = new usuari();
      $profesionales = $this->db->table('turnos');
      $profesionales->where('User',$id);
      $profesionales->orderBy('Día','ASC');
      $profesionales->orderBy('Hora','ASC');
      $res = $profesionales->get()->getResult();