web/GrupoTea/app/Models/usuari.php

    public function comprobar($ce,$ps)
    {
      $usuario = $this->db->table('usuarios');
      $usuario->where(['Mail'=> $ce]);
      $dato = $usuario->get()->getRow('Pass');
---
SELECT *
FROM `usuarios`
WHERE `Mail` = '123@456'

    public function obtenerDatos($ce)
    {
      $usuario = $this->db->table('usuarios');
      $usuario->where(['Mail'=> $ce]);
      $dato= $usuario->get()->getRow();
---
SELECT *
FROM `usuarios`
WHERE `Mail` = '123@456'

    public function obtenerNombre($id)
    {
      $usuario = $this->db->table('usuarios');
      $usuario->where(['ID'=> $id]);
      $dato= $usuario->get()->getRow();
---
SELECT *
FROM `usuarios`
WHERE `ID` = '1'

    public function listarUsers()
    {
      $usuario = $this->db->table('usuarios');
      $usuario->where(['Tipo'=> 'User']);
      $dato= $usuario->get()->getResult();
---
SELECT *
FROM `usuarios`
WHERE `Tipo` = 'User'